class Stop {
  final String id;
  final String nameAr;
  final double lat;
  final double lon;

  Stop({
    required this.id,
    required this.nameAr,
    required this.lat,
    required this.lon,
  });
}

final List<Stop> stops = [
  Stop(id: "316823148", nameAr: "محطة النصر", lat: 31.2488275, lon: 29.9796529),
  Stop(id: "316824347", nameAr: "محطة باكوس", lat: 31.2348552, lon: 29.9659175),
  Stop(
      id: "316824433",
      nameAr: "محطة الرياضة (سبورتنج) الكبرى",
      lat: 31.2183272,
      lon: 29.9327185),
  Stop(id: "316824788", nameAr: "محطة الرمل", lat: 31.2015623, lon: 29.9011406),
  Stop(id: "316829952", nameAr: "محطة بُكلة", lat: 31.2314273, lon: 29.9548652),
  Stop(
      id: "401866306",
      nameAr: "محطة الرياضة (سبورتنج) الصغرى",
      lat: 31.2168581,
      lon: 29.9302303),
  // Stop( repeated 
  //     id: "1091401101",
  //     nameAr: "محطة الشبان المسلمين",
  //     lat: 31.20727,
  //     lon: 29.9130408),
  Stop(
      id: "1263172984",
      nameAr: "محطة الأزاريطة",
      lat: 31.2039707,
      lon: 29.9062507),
  Stop(
      id: "1263173062",
      nameAr: "محطة جامع ابراهيم",
      lat: 31.2027191,
      lon: 29.9034442),
  Stop(
      id: "1885060212",
      nameAr: "محطة مصطفى كامل",
      lat: 31.2242143,
      lon: 29.9453276),
  Stop(
      id: "1886590968",
      nameAr: "محطة جناكليس",
      lat: 31.2431729,
      lon: 29.9692122),
  Stop(
      id: "1886590988",
      nameAr: "محطة سان ستيفانو",
      lat: 31.2452178,
      lon: 29.9679321),
  Stop(
      id: "3880407513",
      nameAr: "محطة سيدي بشر",
      lat: 31.2525588,
      lon: 29.9766823),
  Stop(
      id: "3909161113",
      nameAr: "محطة السيوف",
      lat: 31.2517716,
      lon: 29.9789796),
  Stop(
      id: "3909161121",
      nameAr: "محطة السرايا",
      lat: 31.2517382,
      lon: 29.9743809),
  Stop(
      id: "3909161122", nameAr: "محطة لوران", lat: 31.2495429, lon: 29.9716712),
  Stop(id: "3909161123", nameAr: "محطة ثروت", lat: 31.2475056, lon: 29.9691849),
  Stop(
      id: "3950015169",
      nameAr: "محطة ترام الوزارة",
      lat: 31.2323621,
      lon: 29.9572958),
  Stop(id: "4002201610", nameAr: "قصر الصفا", lat: 31.2421865, lon: 29.9647936),
  Stop(
      id: "4002201650",
      nameAr: "محطة سيدي جابر الشيخ",
      lat: 31.2234788,
      lon: 29.9417414),
  Stop(
      id: "4002201652",
      nameAr: "سيدي جابر المحطة",
      lat: 31.2204673,
      lon: 29.9426357),
  Stop(id: "4478874012", nameAr: "محطة جليم", lat: 31.2396713, lon: 29.9604474),
  Stop(
      id: "4478874013",
      nameAr: "محطة الفنون الجميلة",
      lat: 31.2404325,
      lon: 29.9617385),
  Stop(id: "4628330183", nameAr: "محطة رشدي", lat: 31.228945, lon: 29.9514973),
  Stop(
      id: "4669952291",
      nameAr: "محطة سابا باشا",
      lat: 31.236307,
      lon: 29.9571761),
  Stop(
      id: "4748507684",
      nameAr: "محطة كليوباترا الكبرى",
      lat: 31.221523,
      lon: 29.9382563),
  Stop(
      id: "4748562215",
      nameAr: "محطة محمد محفوظ",
      lat: 31.2268992,
      lon: 29.9485458),
  Stop(id: "4792326286", nameAr: "محطة شوتس", lat: 31.2400777, lon: 29.971308),
  Stop(
      id: "4984424561",
      nameAr: "محطة الشهيد مصطفى زيان",
      lat: 31.20591,
      lon: 29.9103323),
  Stop(
      id: "5969128858", nameAr: "محطة فلمنج", lat: 31.2335792, lon: 29.9602682),
  Stop(
      id: "6095358858",
      nameAr: "محطة ترام كليوباترا (زنانيري)",
      lat: 31.2185046,
      lon: 29.938747),
  Stop(
      id: "6095379250",
      nameAr: "محطة كليوباترا الصغرى",
      lat: 31.2201196,
      lon: 29.9358088),
  Stop(
      id: "6095433434", nameAr: "كامب شيزار", lat: 31.2127372, lon: 29.9231694),
  Stop(
      id: "6095433435",
      nameAr: "محطة الشاطبي",
      lat: 31.2094977,
      lon: 29.9173761),
  Stop(
      id: "6095471258",
      nameAr: "محطة الجامعة",
      lat: 31.2113138,
      lon: 29.9207195),
  Stop(
      id: "6095519914",
      nameAr: "محطة الشبان المسلمين",
      lat: 31.2077321,
      lon: 29.9138658),
  Stop(
      id: "8412131578",
      nameAr: "محطة الهدايا",
      lat: 31.2329149,
      lon: 29.9556153),
  Stop(id: "8412131579", nameAr: "محطة صفر", lat: 31.2361763, lon: 29.9692412),
  Stop(
      id: "10970120024",
      nameAr: "محطة الإبراهيمية",
      lat: 31.214524,
      lon: 29.9261539),
];
